run/constant/cbp/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/cbp/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    cbpRight
    {
        type            patch;
        nFaces          968;
        startFace       67522;
    }
    cbpSides
    {
        type            patch;
        nFaces          4260;
        startFace       68490;
    }
    cbp_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          10208;
        startFace       72750;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_cbp;
    }
)

// ************************************************************************* //
