run/constant/air/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/air";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cgdl
{
    type            myDarcyForchheimer;
    active          true;
    cellZone        cgdl;
    
    porosity        0.5;

    Cp              Cp [0 2 -2 -1 0 0 0]    710.0;
    k               k  [1 1 -3 -1 0 0 0]      1.6;
        
    myDarcyForchheimerCoeffs
    {
        d   d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
        f   f [0 -1 0 0 0 0 0] (0 0 0);
        
        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1      (1 0 0);
                e2      (0 0 1);
            }
        }
    }
    
    diffusivity
    {
        //type        fixedDiffusivity;
        //diff0       diff0 [0 2 -1 0 0 0 0]  9.732e-6;
        // ------------------------------------------ //
        type        porousFSG;
        Tname       T;
        pName       p;
        speciesA    O2;     // diffusing species
        speciesB    N2;     // background species
        speciesC    H2O     // background species
        porosity    0.5;
        tortuosity  1.5;
        dPore       dPore [0 1 0 0 0 0 0] 26.4e-06;   // pore size
        doBinary    false;
    }  
}    

ccl
{
    type            myDarcyForchheimer;
    active          true;
    cellZone        ccl;
        
    porosity        0.4;

    Cp              Cp [0 2 -2 -1 0 0 0]    710.0;
    k               k  [1 1 -3 -1 0 0 0]      8.0;

    myDarcyForchheimerCoeffs
    {
        d   d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
        f   f [0 -1 0 0 0 0 0] (0 0 0);
        
        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1      (1 0 0);
                e2      (0 0 1);
            }
        }
    }

    diffusivity
    {
        //type        fixedDiffusivity;
        //diff0       diff0 [0 2 -1 0 0 0 0]  9.732e-6;
        // ------------------------------------------ //
        type        porousFSG;
        Tname       T;
        pName       p;
        speciesA    O2;     // diffusing species
        speciesB    N2;     // background species
        speciesC    H2O     // background species
        porosity    0.4;
        tortuosity  1.5;
        dPore       dPore [0 1 0 0 0 0 0] 119e-09;   // ccl pore size
        doBinary    false;
    }
}
// ************************************************************************* //
