run/constant/cellProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cellProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Hydrogen                 	  Methanol
// V=1.0   @ i=5		V=1.0    @ i=24
// V=0.95  @ i=25		V=0.95   @ i=32
// V=0.9   @ i=100		V=0.90   @ i=39
// V=0.85  @ i=500		V=0.85   @ i=54
// V=0.8   @ i=1000		V=0.80   @ i=85
// V=0.78  @ i=2000		V=0.75   @ i=141
// V=0.74  @ i=3000		V=0.70   @ i=260
// V=0.7   @ i=4000		V=0.65   @ i=362
// V=0.68  @ i=5000		V=0.60   @ i=616
// V=0.64  @ i=6000		V=0.55   @ i=825
// V=0.6   @ i=7000		V=0.50   @ i=1116
// V=0.58  @ i=8000		V=0.45   @ i=1625
// V=0.54  @ i=9000		V=0.40   @ i=2030
// V=0.52  @ i=10000		V=0.35   @ i=2514
// V=0.5   @ i=11000		V=0.30   @ i=3086
// V=0.48  @ i=12000		V=0.25   @ i=3500
// V=0.44  @ i=13000
// V=0.4   @ i=14000
// V=0.35  @ i=15000
// V=0.3   @ i=16000
// V=0.28  @ i=17000
// V=0.24  @ i=18000

// run mode
// true ==> galvanostatic
// false ==> potentiostatic
//
galvanostatic false;

// voltage
// galvanostatic ==> initial value
// potentiostatic ==> prescribed value
//
voltage          V           [1 2 -3 0 0 -1 0]       0.6; // volts

// mean current density
// galvanostatic ==> prescribed value
// potentiostatic ==> initial value
//
Ibar0            Ibar0       [0 -2 0 0 0 1 0]     616.0; // amperes/m^2

// available fuel cell types: PEMFC
fuelCellType     PEMFC;

// voltage correction relaxation coefficient for galvanostatic run
//
Rhat             Rhat        [1 4 -3 0 0 -2 0]    1.0e-5; // ohm m^2
Rhat0            Rhat0       [1 4 -3 0 0 -2 0]    1.0e-5; // ohm m^2, relaxation 

// initial Temperature for fuel and air T fields
Tinit		 Tinit       [0 0 0 1 0 0 0]       353.0; // K
numCells	 numCells    [0 0 0 0 0 0 0]           1; // K

// components electronic conductivity - Siemens per meter (S/m)
kappaCl          kappaCl     [-1 -2 3 0 0 2 0]     1.0e+3;
kappaGdl         kappaGdl    [-1 -2 3 0 0 2 0]     5.0e+3;
kappaBp          kappaBp     [-1 -2 3 0 0 2 0]     8.3e+4;

// contact resistance (GDL - BP)
rContact         rContact    [1 4 -3 0 0 -2 0]    2.0e-6; //ohm*m^2

// components thickness (m) 
tCl              tCl         [0 1 0 0 0 0 0]      3.7e-6;
tGdl             tGdl        [0 1 0 0 0 0 0]      4.1e-4;
tBp              tBp         [0 1 0 0 0 0 0]      3.0e-3;

// components porosity
epsilonGdl       epsilonGdl  [0 0 0 0 0 0 0]         0.5; // typical
epsilonCl        epsilonCl   [0 0 0 0 0 0 0]         0.4; // typical

// concentration overpotential constant
etaConCaConstant etaConCaConstant [0 0 0 0 0 0 0]    0.25; // typical, O'Hayre(2006) p.149

//Reference concentrations
//MDA 2021
cMeRef           cMeRef  [0 -3 0 0 1 0 0]        2000; //mol/m³ Ge Liu 2006
cO2Ref           cO2Ref  [0 -3 0 0 1 0 0]       0.472; //mol/m³

//Upper and Lower Ridders Root boundaries. MDA2021
upperBoundary  upperBoundary  [0  0 0 0 0 0 0]       1; //To be defined MDA2021 
lowerBoundary  lowerBoundary  [0  0 0 0 0 0 0]      10000;

// special patch names
fuelInletPatch               fuelInlet;
fuelOutletPatch              fuelOutlet;
anodePatch                   fuel_to_electrolyte;
fuelAbpPatch                 fuel_to_abp;

airInletPatch                airInlet;
airOutletPatch               airOutlet;
cathodePatch                 air_to_electrolyte;
airCbpPatch                  air_to_cbp;

electrolyteAnodePatch        electrolyte_to_fuel;
electrolyteCathodePatch      electrolyte_to_air;

abpFuelPatch                 abp_to_fuel;
cbpAirPatch                  cbp_to_air;

// ************************************************************************* //

