run/constant/electrolyte/electrolyteProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/electrolyte";
    object      electrolyteProperties;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho          [1 -3 0 0 0 0 0]            1980.0;
Cp              Cp           [0 2 -2 -1 0 0 0]           1050.0;
k               k            [1 1 -3 -1 0 0 0]             0.67;
sigma           sigma        [-1 -2 3 0 0 2 0]             17.0; //Siemens per meter

// ************************************************************************* //
