run/constant/fuel/fuelProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fuel";
    object      fuelProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Fuel(CH3OH) properties @ 353 K Modification for methanol

rho             rho     [1 -3 0 0 0 0 0]       1.138;
mu              mu      [1 -1 -1 0 0 0 0]     1.155227108e-5;
Cp              Cp      [0 2 -2 -1 0 0 0]     3743;
k               k       [1 1 -3 -1 0 0 0]     0.01805811;

// hydraulic diameter for Reynolds Number calculation
// code will skip calculation if value = 0
//dHyd            dHyd    [0 1 0 0 0 0 0]      0;
dHyd            dHyd    [0 1 0 0 0 0 0]      1.0e-3;

diffusivity
{
    type        fixedDiffusivity;
    diff0       diff0 [0 2 -1 0 0 0 0]  2.11143e-5; //Wang & Wang citing Yaws
    // -------------------------------------
    /*type        binaryFSG;
    Tname       T;
    pName       p;
    speciesA    CH3OH;
    speciesB    H2O;
    speciesC    CO2;*/
    //Modification for methanol
}

// ************************************************************************* //
