run/constant/fuel/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fuel";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

agdl
{
    type            myDarcyForchheimer;
    active          true;
    cellZone        agdl;

    porosity        0.5;

    Cp              Cp [0 2 -2 -1 0 0 0]    710.0;
    k               k  [1 1 -3 -1 0 0 0]      1.6;
    
    myDarcyForchheimerCoeffs
    {
        d   d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
        f   f [0 -1 0 0 0 0 0] (0 0 0);
        
        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1      (1 0 0);
                e2      (0 0 1);
            }
        }
    }

    diffusivity
    {
        type        fixedDiffusivity;
        diff0       diff0 [0 2 -1 0 0 0 0]  7.465e-6; //Deff=D*porosity^1.5
        // ------------------------------------------ //
        //type        porousFSG;
        //Tname       T;
        //pName       p;
        //speciesA    H2;     // diffusing species
        //speciesB    H2O;    // background species
        //porosity    0.5;
        //tortuosity  1.5;
        //dPore       dPore [0 1 0 0 0 0 0] 26.4e-06;   // pore size
        //doBinary    false;
    }
}

acl
{
    type            myDarcyForchheimer;
    active          true;
    cellZone        acl;

    porosity        0.4;

    Cp              Cp [0 2 -2 -1 0 0 0]    710.0;
    k               k  [1 1 -3 -1 0 0 0]      1.6;

    myDarcyForchheimerCoeffs
    {
        d   d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
        f   f [0 -1 0 0 0 0 0] (0 0 0);
        
        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            coordinateRotation
            {
                type    axesRotation;
                e1      (1 0 0);
                e2      (0 0 1);
            }
        }
    }

    diffusivity
    {
        type        fixedDiffusivity;
        diff0       diff0 [0 2 -1 0 0 0 0]  1.8885e-6; //Deff=D*porosity^1.5
        // ------------------------------------------ //
        //type        porousFSG;
        //Tname       T;
        //pName       p;
        //speciesA    H2;     // diffusing species
        //speciesB    H2O;    // background species
        //porosity    0.4;
        //tortuosity  1.5;
        //dPore       dPore [0 1 0 0 0 0 0] 119e-09;   // pore size
        //doBinary    false;
    }
}
// ************************************************************************* //
