run/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 0;

boundaryField
{
    abpLeft
    {
        type         zeroGradient;
    }

    abpSides
    {
        type         zeroGradient;
    }

    fuelInlet
    {
        type         fixedValue;
        value        uniform 1.0e-15;    //disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }

    fuelOutlet
    {
        type         zeroGradient;
    }

    fuelSides
    {
        type         zeroGradient;
    }

    agdlSides
    {
        type         zeroGradient;
    }

    aclSides
    {
        type         zeroGradient;
    }  

    electrolyteSides
    {
        type         zeroGradient;
    }

    cclSides
    {
        type         zeroGradient;
    }

    cgdlSides
    {
        type         zeroGradient;
    }

    airInlet
    {
        type         fixedValue;
        value        uniform 1.0e-15;    //disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }

    airOutlet
    {
        type         zeroGradient;
    }

    airSides
    {
        type         zeroGradient;
    }  
  
    cbpSides
    {
        type         zeroGradient;
    }

    cbpRight
    {
        type         zeroGradient;
    }
}

// ************************************************************************* //
